import pytest


@pytest.fixture
def excel_file_list(nan=None) -> list[dict]:
    return [
        {
            "Дата операции": "17.10.2019 00:00:00",
            "Дата платежа": "19.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -687.41,
            "Валюта операции": "RUB",
            "Сумма платежа": -687.41,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 13,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 687.41,
        },
        {
            "Дата операции": "03.08.2019 01:35:52",
            "Дата платежа": "05.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -161.7,
            "Валюта операции": "RUB",
            "Сумма платежа": -161.7,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 161.7,
        },
        {
            "Дата операции": "03.06.2019 00:02:33",
            "Дата платежа": "05.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -135.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -135.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 135.8,
        },
        {
            "Дата операции": "02.11.2019 21:51:39",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -102.73,
            "Валюта операции": "RUB",
            "Сумма платежа": -102.73,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 102.73,
        },
        {
            "Дата операции": "02.10.2019 16:48:34",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -159.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -159.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 159.8,
        },
        {
            "Дата операции": "02.05.2019 15:13:21",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -75.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -75.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "McDonald's",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 75.0,
        },
        {
            "Дата операции": "02.03.2019 14:02:30",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7198",
            "Статус": "OK",
            "Сумма операции": -167.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -167.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Крошка Картошка",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 167.0,
        },
        {
            "Дата операции": "02.03.2019 13:54:22",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7198",
            "Статус": "OK",
            "Сумма операции": -78.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -78.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 78.0,
        },
        {
            "Дата операции": "02.03.2019 12:49:51",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -350.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -350.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "SUPERMANGO",
            "Бонусы (включая кэшбэк)": 7,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 350.0,
        },
        {
            "Дата операции": "01.03.2019 15:37:24",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -240.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -240.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Bufet 2",
            "Бонусы (включая кэшбэк)": 4,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 240.0,
        },
    ]


@pytest.fixture
def excel_list_filter_date(nan: None = None) -> list[dict]:
    return [
        {
            "Дата операции": "02.03.2019 14:02:30",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7198",
            "Статус": "OK",
            "Сумма операции": -167.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -167.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Крошка Картошка",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 167.0,
        },
        {
            "Дата операции": "02.03.2019 13:54:22",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7198",
            "Статус": "OK",
            "Сумма операции": -78.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -78.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 78.0,
        },
        {
            "Дата операции": "02.03.2019 12:49:51",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -350.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -350.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "SUPERMANGO",
            "Бонусы (включая кэшбэк)": 7,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 350.0,
        },
        {
            "Дата операции": "01.03.2019 15:37:24",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -240.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -240.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Bufet 2",
            "Бонусы (включая кэшбэк)": 4,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 240.0,
        },
    ]


@pytest.fixture
def filter_list(nan: None = None) -> list[list[dict]]:
    return [
        [
            {
                "Дата операции": "02.03.2019 12:49:51",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -350.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -350.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": nan,
                "Категория": "Фастфуд",
                "MCC": 5814.0,
                "Описание": "SUPERMANGO",
                "Бонусы (включая кэшбэк)": 7,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 350.0,
            },
            {
                "Дата операции": "01.03.2019 15:37:24",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -240.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -240.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": nan,
                "Категория": "Фастфуд",
                "MCC": 5814.0,
                "Описание": "Bufet 2",
                "Бонусы (включая кэшбэк)": 4,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 240.0,
            },
        ],
        [
            {
                "Дата операции": "02.03.2019 14:02:30",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7198",
                "Статус": "OK",
                "Сумма операции": -167.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -167.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": nan,
                "Категория": "Фастфуд",
                "MCC": 5814.0,
                "Описание": "Крошка Картошка",
                "Бонусы (включая кэшбэк)": 3,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 167.0,
            },
            {
                "Дата операции": "02.03.2019 13:54:22",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7198",
                "Статус": "OK",
                "Сумма операции": -78.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -78.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": nan,
                "Категория": "Супермаркеты",
                "MCC": 5499.0,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 1,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 78.0,
            },
        ],
    ]


@pytest.fixture
def spent_cards() -> list[dict]:
    return [
        {"last_digits": "7197", "total_spent": 240.0, "cashback": 2.4},
        {"last_digits": "7198", "total_spent": 78.0, "cashback": 0.78},
    ]


@pytest.fixture
def example_list() -> list[dict]:
    return [
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -167.0,
            "Категория": "Фастфуд",
            "Описание": "Крошка Картошка",
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -78.0,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -350.0,
            "Категория": "Фастфуд",
            "Описание": "SUPERMANGO",
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -240.0,
            "Категория": "Фастфуд",
            "Описание": "Bufet 2",
        },
    ]


@pytest.fixture
def top() -> list[dict]:
    return [
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -350.0,
            "Категория": "Фастфуд",
            "Описание": "SUPERMANGO",
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -240.0,
            "Категория": "Фастфуд",
            "Описание": "Bufet 2",
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -167.0,
            "Категория": "Фастфуд",
            "Описание": "Крошка Картошка",
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -78.0,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
    ]


@pytest.fixture
def top_list() -> list[dict]:
    return [
        {
            "date": "04.03.2019",
            "amount": -167.0,
            "category": "Фастфуд",
            "description": "Крошка Картошка",
        },
        {
            "date": "04.03.2019",
            "amount": -78.0,
            "category": "Супермаркеты",
            "description": "Колхоз",
        },
        {
            "date": "04.03.2019",
            "amount": -350.0,
            "category": "Фастфуд",
            "description": "SUPERMANGO",
        },
        {
            "date": "04.03.2019",
            "amount": -240.0,
            "category": "Фастфуд",
            "description": "Bufet 2",
        },
    ]


@pytest.fixture
def cards() -> list[dict]:
    return [
        {
            "Дата операции": "02.03.2019 12:49:51",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7197",
        },
        {
            "Дата операции": "01.03.2019 15:37:24",
            "Дата платежа": "04.03.2019",
            "Номер карты": "*7198",
        },
    ]


@pytest.fixture
def filter_for_cards() -> list[list[dict]]:
    return [
        [
            {
                "Дата операции": "01.03.2019 15:37:24",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7198",
            }
        ],
        [
            {
                "Дата операции": "02.03.2019 12:49:51",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7197",
            }
        ],
    ]


@pytest.fixture
def filter_for_card() -> list[list[dict]]:
    return [
        [
            {
                "Дата операции": "02.03.2019 12:49:51",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7197",
            }
        ],
        [
            {
                "Дата операции": "01.03.2019 15:37:24",
                "Дата платежа": "04.03.2019",
                "Номер карты": "*7198",
            }
        ],
    ]


@pytest.fixture
def reports_example_now() -> list[dict]:
    return [
        {
            "Дата платежа": "04.11.2025",
            "Сумма платежа": -167.0,
            "Категория": "Фастфуд",
            "Кэшбэк": 1.7,
        },
        {
            "Дата платежа": "04.11.2025",
            "Сумма платежа": -78.0,
            "Категория": "Супермаркеты",
            "Кэшбэк": 0.8,
        },
        {
            "Дата платежа": "07.12.2025",
            "Сумма платежа": -60.0,
            "Категория": "Супермаркеты",
            "Кэшбэк": 0.6,
        },
    ]


@pytest.fixture
def reports_example() -> list[dict]:
    return [
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -167.0,
            "Категория": "Фастфуд",
            "Кэшбэк": 1.7,
        },
        {
            "Дата платежа": "04.03.2019",
            "Сумма платежа": -78.0,
            "Категория": "Супермаркеты",
            "Кэшбэк": 0.8,
        },
        {
            "Дата платежа": "07.03.2019",
            "Сумма платежа": -60.0,
            "Категория": "Супермаркеты",
            "Кэшбэк": 0.6,
        },
    ]
