from src.services import prof_cashback, investment_bank, form_list_transactions
import pytest


@pytest.mark.parametrize("data, year, month, expected", [([{"Дата платежа": "04.03.2019",
            "Сумма платежа": -167.0,
            "Категория": "Фастфуд", "Кэшбэк": 1.7}, {"Дата платежа": "04.03.2019",
            "Сумма платежа": -78.0,
            "Категория": "Супермаркеты", "Кэшбэк": 0.8}, {"Дата платежа": "07.03.2019",
            "Сумма платежа": -60.0,
            "Категория": "Супермаркеты", "Кэшбэк": 0.6}], '2019', '3', '{\n    "Фастфуд": 1.7,\n    "Супермаркеты": 1.4\n}'
), ([{"Дата платежа": "04.03.2020",
            "Сумма платежа": -167.0,
            "Категория": "Фастфуд", "Кэшбэк": 1.7}, {"Дата платежа": "04.10.2019",
            "Сумма платежа": -78.0,
            "Категория": "Супермаркеты", "Кэшбэк": 0.8}, {"Дата платежа": "07.11.2019",
            "Сумма платежа": -60.0,
            "Категория": "Супермаркеты", "Кэшбэк": 0.6}], '2019', '3', {}
)])
def test_prof_cashback(data, year, month, expected):
    assert prof_cashback(data, year, month) == expected


@pytest.mark.parametrize('month, transactions, limit, expected', [('2019-11', [{"Дата операции": "2019-11-02", "Сумма операции": 1138}, {"Дата операции": "2019-11-05", "Сумма операции": 1234}, {"Дата операции": "2019-11-05", "Сумма операции": 30089}], 50, 28), ('2019-11', [{"Дата операции": "2019-11-02", "Сумма операции": 1138}, {"Дата операции": "2019-11-05", "Сумма операции": 1234}, {"Дата операции": "2019-11-05", "Сумма операции": 30089}], 100, 11), ('2018-11', [{"Дата операции": "2019-11-02", "Сумма операции": 1138}, {"Дата операции": "2019-11-05", "Сумма операции": 1234}, {"Дата операции": "2019-11-05", "Сумма операции": 30089}], 100, 0)])
def test_investment_bank(month, transactions, limit, expected):
    assert investment_bank(month, transactions, limit) == expected


@pytest.mark.parametrize('data, expected', [([{"Дата платежа": "04.03.2019",
            "Сумма операции": -167.0,
            "Категория": "Фастфуд", "Кэшбэк": 1.7}, {"Дата платежа": "04.03.2019",
            "Сумма операции": -78.0,
            "Категория": "Супермаркеты", "Кэшбэк": 0.8}, {"Дата платежа": "07.03.2019",
            "Сумма операции": -60.0,
            "Категория": "Супермаркеты", "Кэшбэк": 0.6}], [{"Дата операции": "2019-03-04",
            "Сумма операции": 167}, {"Дата операции": "2019-03-04",
            "Сумма операции": 78}, {"Дата операции": "2019-03-07",
            "Сумма операции": 60}])])
def test_form_list_transactions(data, expected):
    assert form_list_transactions(data) == expected
